{
  "posts": [
    {
      "id": 2,
      "title": "A bug on production",
      "date": "07/02/2024",
      "description": "Yesterday when I updated my portfolio a bug appeared in react-router-dom, and this is how i solved it.",
      "body": [
        "Hello everyone,",
        "Yesterday, I created my blog and excitedly deployed it on Vercel. Unfortunately, I encountered a bug: whenever a user clicked on a card to access a post page or reloaded the page after clicking on a post, my website crashed. I initially suspected a bug in the card component, but my attempts to fix it were unsuccessful.",
        "Today, this problem continued to trouble me, with no solution coming to mind. I had already sought help from various developer communities and AI resources, but no one could identify the issue. Since the Vercel 404 page appeared when the error occurred, I consulted the Vercel documentation, but again found no answers. Fortunately, I decided to try explaining my problem to AI again, this time using Microsoft Copilot. Within a minute, it provided me with the code to fix the bug - a Vercel.json configuration for Single-Page Applications (SPAs)."
      ],
      "tags": ["React.js", "react-router-dom", "vercel"]
    },
    {
      "id": 1,
      "title": "This blog history",
      "date": "06/02/2024",
      "description": "First post telling how I created this blog without a backend.",
      "body": [
        "Hello everyone,",
        "I've always wanted to have a blog on my portfolio to share experiences, code snippets, and more. However, whenever I considered how to implement it, I immediately envisioned a complex setup with a backend, login system, database, and the associated environment. For a portfolio, that seemed like overkill, and I was hesitant to introduce potential vulnerabilities, API concerns, and database hosting issues.",
        "Initially, I contemplated hardcoding the blog, but I recognized that this would be a bad practice and impractical for adding new posts easily. Fortunately, I realized that I could simulate a database using JSON and insert posts directly into it. This is how I built my blog, and you can find the complete source code in the linked repository on my portfolio (link below)."
      ],
      "tags": ["React.js", "JSON"],
      "links": [
        {
          "text": "Github repository",
          "link": "https://github.com/phbrg/portfolio"
        }
      ]
    }
  ]
}