{
  "eng": [
    {
      "id": 1,
      "title": "My path throug coding",
      "date": "02/21/2024",
      "description": "How I started my coding journey and where I am now in my coding career.",
      "body": [
        "Hello world,",
        "I started my coding journey almost two years ago, in 2022, by creating game modifications with Lua. It was really fun, and at that time, I was only coding for hobby. Prior to 2022, I had never written a single line of code, but when I discovered that I could modify and create my own things with code, I was amazed.",
        "Back then, I was only coding for fun and didn't even consider getting paid or turning this hobby into a job. However, the more I researched it, the more fascinated I became with coding. Shortly after, I discovered HTML and CSS, and I was amazed that with some HTML tags and some CSS styles, I could create a real website with anything I wanted.",
        "For almost a year, I created static websites with HTML and CSS and didn't focus much on coding at all. I started doing it again just for fun and forgot that I could transform it into something bigger. Sometime later, I moved to another school, which was now a technical school, and that feeling of wanting to improve myself and my knowledge blossomed again.",
        "I didn't learn much at school because the teaching was very weak, but I started researching coding more, exploring what I could become and what coding careers I could pursue. Initially, I thought I wanted to be a front-end developer, building beautiful and large websites. However, when I discovered back-end development and Node.js, I abandoned the idea of becoming a front-end developer and just focused on back-end development with it.",
        "Currently, I have learned Node.js and built some projects with it. I have also learned and built projects with React.js (a front-end JavaScript framework). I am now learning Nest and some other technologies like Docker and Jest."
      ],
      "tags": ["Tech", "History"],
      "links": [],
      "image": null
    },
    {
      "id": 2,
      "title": "I hate front-end",
      "date": "21/04/2024",
      "description": "Things that I hate in front-end and why I don't like front-end.",
       "body": [
        "Hello world,",
        "As soon as I discovered back-end, I almost completely erased from my mind that initial idea of being a front-end developer. I started to dedicate myself entirely to evolving and improving my knowledge only in back-end, and I do not regret it. However, I still have to deal with front-end and its frameworks.",
        "Currently, I use React.js as a front-end framework. It was the first one I had contact with and found the most practical, but, my God, how coding in this framework (and in all front-ends in general) is ''messy''! You don't divide the code in the right way, or when you do, you divide it too much. Solutions that should be simple become complex (like setting a global variable) and, in addition to all this complexity, I still have to think about UI/UX and design.",
        "When I realized this, my desire to become a full-stack developer almost went down the drain. Despite still trying hard to learn and study the damn front-end, I get really angry with the way things are done. One example of this is returning HTML code inside a logic file. Like, why? Why don't we separate things? Besides having to deal with performance, even having to make several requests, deal with responses, load styles and images, and all this in a .tsx file that in the end returns things like <h1>Hello {user.name}, how are you?</h1>.",
        "I really find it bizarre how front-end is done nowadays. It's hard to understand it like I understand back-end."
      ],
      "tags": ["Front-end", "Tech"],
      "links": [],
      "image": null
    }
  ],
  "pt": [
    {
      "id": 1,
      "title": "Minha jornada no mundo da programação",
      "date": "21/02/2024",
      "description": "Como eu comecei e minha jornada até o momento atual na programação.",
       "body": [
        "Hello world,",
        "Eu iniciei minha jornada na programação há quase dois anos, em 2022, criando modificações de jogos com Lua. Foi muito divertido, e naquela época, eu só programava por hobby. Antes de 2022, eu nunca tinha escrito uma única linha de código, mas quando descobri que podia modificar e criar minhas próprias coisas com código, fiquei maravilhado.",
        "Naquela época, eu só programava por diversão e nem considerava ser pago ou transformar esse hobby em profissão. No entanto, quanto mais eu pesquisava, mais fascinado ficava com a programação. Logo depois, descobri HTML e CSS, e fiquei impressionado que com algumas tags HTML e estilos CSS, eu poderia criar um site real com tudo o que eu quisesse.",
        "Por quase um ano, criei sites estáticos com HTML e CSS e não foquei muito em programação. Comecei a fazer de novo só por diversão e esqueci que podia transformar isso em algo maior. Mais tarde, mudei para outra escola, que agora era técnica, e aquela vontade de me aprimorar e aumentar meu conhecimento floresceu novamente.",
        "Não aprendi muito na escola porque o ensino era muito fraco, mas comecei a pesquisar mais sobre programação, explorando o que eu poderia me tornar e quais carreiras em programação eu poderia seguir. Inicialmente, pensei em ser um desenvolvedor front-end, construindo sites grandes e bonitos. No entanto, quando descobri o desenvolvimento back-end e o Node.js, abandonei a ideia de me tornar um desenvolvedor front-end e me concentrei apenas no back-end com ele.",
        "Atualmente, aprendi Node.js e construí alguns projetos com ele. Também aprendi e construí projetos com React.js (um framework front-end de JavaScript). Agora estou aprendendo Nest e algumas outras tecnologias como Docker e Jest."
      ],
      "tags": ["Tech", "Historia"],
      "links": [],
      "image": null
    },
    {
      "id": 2,
      "title": "Eu odeio front-end",
      "date": "21/04/2024",
      "description": "Coisas que me irritam e o motivo de eu não gostar de front-end.",
       "body": [
        "Hello world,",
        "Assim que conheci o back-end, apaguei quase que totalmente da minha cabeça aquela ideia inicial de ser front-end. Passei a me dedicar inteiramente a evoluir e melhorar meus conhecimentos apenas no back-end, e não me arrependo. No entanto, ainda preciso lidar com front-end e seus frameworks.",
        "Atualmente uso React.js como framework no front-end. Foi o primeiro que tive contato e achei mais prático, mas, meu Deus do céu, como codar nesse framework (e em todos os front-ends no geral) é ''porco''! Você não divide o código da maneira certa, ou quando divide, divide até demais. Soluções que deveriam ser simples se tornam complexas (como definir uma variável global) e, além de toda essa complexidade, ainda preciso pensar em UI/UX e design.",
        "Quando percebi isso, minha vontade de me tornar um desenvolvedor full-stack quase foi por água abaixo. Apesar de ainda tentar duramente aprender e estudar o bendito front-end, fico realmente bravo com o jeito que as coisas são feitas. Um exemplo disso é retornar um código HTML dentro de um arquivo de lógica. Tipo, por quê? Que tal separarmos as coisas? Fora ter que lidar com desempenho, mesmo tendo que fazer vários requests, lidar com respostas, carregar estilos e imagens, e tudo isso em um arquivo .tsx que no final retornar coisas como <h1>Olá {user.name}, tudo bem?</h1>.",
        "Eu realmente acho bizarro como o front-end é feito hoje em dia. É difícil entender ele como eu entendo o back-end."
      ],
      "tags": ["Front-end", "Tech"],
      "links": [],
      "image": null
    }
  ]
}