{
  "eng": [
    {
      "id": 1,
      "title": "My path throug coding",
      "date": "21/02/2024",
      "description": "📜 How I started my coding journey and where I am now in my coding career.",
      "body": [
        "Hello world,",
        "I started my coding journey almost two years ago, in 2022, by creating game modifications with Lua. It was really fun, and at that time, I was only coding for hobby. Prior to 2022, I had never written a single line of code, but when I discovered that I could modify and create my own things with code, I was amazed.",
        "Back then, I was only coding for fun and didn't even consider getting paid or turning this hobby into a job. However, the more I researched it, the more fascinated I became with coding. Shortly after, I discovered HTML and CSS, and I was amazed that with some HTML tags and some CSS styles, I could create a real website with anything I wanted.",
        "For almost a year, I created static websites with HTML and CSS and didn't focus much on coding at all. I started doing it again just for fun and forgot that I could transform it into something bigger. Sometime later, I moved to another school, which was now a technical school, and that feeling of wanting to improve myself and my knowledge blossomed again.",
        "I didn't learn much at school because the teaching was very weak, but I started researching coding more, exploring what I could become and what coding careers I could pursue. Initially, I thought I wanted to be a front-end developer, building beautiful and large websites. However, when I discovered back-end development and Node.js, I abandoned the idea of becoming a front-end developer and just focused on back-end development with it.",
        "Currently, I have learned Node.js and built some projects with it. I have also learned and built projects with React.js (a front-end JavaScript framework). I am now learning Nest and some other technologies like Docker and Jest."
      ],
      "tags": ["Tech", "History"],
      "links": []
    }
  ],
  "pt": [
    {
      "id": 1,
      "title": "Minha jornada no mundo da programação",
      "date": "21/02/2024",
      "description": "📜 Como eu comecei e minha jornada até o momento atual na programação.",
       "body": [
        "Hello world,",
        "Eu iniciei minha jornada na programação há quase dois anos, em 2022, criando modificações de jogos com Lua. Foi muito divertido, e naquela época, eu só programava por hobby. Antes de 2022, eu nunca tinha escrito uma única linha de código, mas quando descobri que podia modificar e criar minhas próprias coisas com código, fiquei maravilhado.",
        "Naquela época, eu só programava por diversão e nem considerava ser pago ou transformar esse hobby em profissão. No entanto, quanto mais eu pesquisava, mais fascinado ficava com a programação. Logo depois, descobri HTML e CSS, e fiquei impressionado que com algumas tags HTML e estilos CSS, eu poderia criar um site real com tudo o que eu quisesse.",
        "Por quase um ano, criei sites estáticos com HTML e CSS e não foquei muito em programação. Comecei a fazer de novo só por diversão e esqueci que podia transformar isso em algo maior. Mais tarde, mudei para outra escola, que agora era técnica, e aquela vontade de me aprimorar e aumentar meu conhecimento floresceu novamente.",
        "Não aprendi muito na escola porque o ensino era muito fraco, mas comecei a pesquisar mais sobre programação, explorando o que eu poderia me tornar e quais carreiras em programação eu poderia seguir. Inicialmente, pensei em ser um desenvolvedor front-end, construindo sites grandes e bonitos. No entanto, quando descobri o desenvolvimento back-end e o Node.js, abandonei a ideia de me tornar um desenvolvedor front-end e me concentrei apenas no back-end com ele.",
        "Atualmente, aprendi Node.js e construí alguns projetos com ele. Também aprendi e construí projetos com React.js (um framework front-end de JavaScript). Agora estou aprendendo Nest e algumas outras tecnologias como Docker e Jest."
      ],
      "tags": ["Tech", "Historia"],
      "links": []
    }
  ]
}