{
  "eng": [
    {
      "id": 1,
      "title": "My path throug coding",
      "date": "Feb, 2024",
      "description": "How I started and my journey to this point in programming.",
      "body": [
        "Hello world,",
        "I started my coding journey almost two years ago, in 2022, by creating game modifications with Lua. It was really fun, and at that time, I was only coding for hobby. Prior to 2022, I had never written a single line of code, but when I discovered that I could modify and create my own things with code, I was amazed.",
        "Back then, I was only coding for fun and didn't even consider getting paid or turning this hobby into a job. However, the more I researched it, the more fascinated I became with coding. Shortly after, I discovered HTML and CSS, and I was amazed that with some HTML tags and some CSS styles, I could create a real website with anything I wanted.",
        "For almost a year, I created static websites with HTML and CSS and didn't focus much on coding at all. I started doing it again just for fun and forgot that I could transform it into something bigger. Sometime later, I moved to another school, which was now a technical school, and that feeling of wanting to improve myself and my knowledge blossomed again.",
        "I didn't learn much at school because the teaching was very weak, but I started researching coding more, exploring what I could become and what coding careers I could pursue. Initially, I thought I wanted to be a front-end developer, building beautiful and large websites. However, when I discovered back-end development and Node.js, I abandoned the idea of becoming a front-end developer and just focused on back-end development with it.",
        "Currently, I have learned Node.js and built some projects with it. I have also learned and built projects with React.js (a front-end JavaScript framework). I am now learning Nest and some other technologies like Docker and Jest."
      ],
      "tags": [],
      "links": [],
      "image": null
    },
    {
      "id": 2,
      "title": "My first job",
      "date": "Dec, 2024",
      "description": "How I got my first job and what my experience there has been like.",
      "body": [
        "Hello world,",
        "Recently, I started my professional journey with my first job, and it has been an incredible experience! I had the opportunity to join Cognizant, one of the largest and most renowned companies in the technology market, as a Young Apprentice. Currently, I work in technical support, but I have big dreams and ambitions within the organization. The support I’ve received from the company has been exceptional, and I’m very pleased with the environment and the opportunities offered.",
        "My journey began at the end of last month, along with the selection process. Although brief, the process was quite thorough: I participated in approximately four stages, including interviews with the Human Resources department, managers, and general alignment meetings. After being approved, we went through an integration period that included onboarding and a week of training at Instituto Ser+ — a government-mandated program aimed at training young apprentices. This stage was an excellent opportunity to get to know my colleagues better, build new friendships, and strengthen the team spirit.",
        "Currently, I am part of a team with two other colleagues, and we are excited to officially start our activities. Meanwhile, we are dedicating ourselves to preparing for this journey by participating in online classes, taking courses, and continuously improving our skills. I am immensely grateful for this opportunity and hope to contribute with excellence to the company’s success."
      ],
      "tags": [],
      "links": [],
      "image": null
    }
  ],
  "pt": [
    {
      "id": 1,
      "title": "Minha jornada no mundo da programação",
      "date": "Fev, 2024",
      "description": "Como eu comecei e minha jornada até o momento atual na programação.",
       "body": [
        "Hello world,",
        "Eu iniciei minha jornada na programação há quase dois anos, em 2022, criando modificações de jogos com Lua. Foi muito divertido, e naquela época, eu só programava por hobby. Antes de 2022, eu nunca tinha escrito uma única linha de código, mas quando descobri que podia modificar e criar minhas próprias coisas com código, fiquei maravilhado.",
        "Naquela época, eu só programava por diversão e nem considerava ser pago ou transformar esse hobby em profissão. No entanto, quanto mais eu pesquisava, mais fascinado ficava com a programação. Logo depois, descobri HTML e CSS, e fiquei impressionado que com algumas tags HTML e estilos CSS, eu poderia criar um site real com tudo o que eu quisesse.",
        "Por quase um ano, criei sites estáticos com HTML e CSS e não foquei muito em programação. Comecei a fazer de novo só por diversão e esqueci que podia transformar isso em algo maior. Mais tarde, mudei para outra escola, que agora era técnica, e aquela vontade de me aprimorar e aumentar meu conhecimento floresceu novamente.",
        "Não aprendi muito na escola porque o ensino era muito fraco, mas comecei a pesquisar mais sobre programação, explorando o que eu poderia me tornar e quais carreiras em programação eu poderia seguir. Inicialmente, pensei em ser um desenvolvedor front-end, construindo sites grandes e bonitos. No entanto, quando descobri o desenvolvimento back-end e o Node.js, abandonei a ideia de me tornar um desenvolvedor front-end e me concentrei apenas no back-end com ele.",
        "Atualmente, aprendi Node.js e construí alguns projetos com ele. Também aprendi e construí projetos com React.js (um framework front-end de JavaScript). Agora estou aprendendo Nest e algumas outras tecnologias como Docker e Jest."
      ],
      "tags": [],
      "links": [],
      "image": null
    },
    {
      "id": 2,
      "title": "Meu primeiro emprego",
      "date": "Dez, 2024",
      "description": "Como eu consegui e como está sendo minha experiência no meu primeiro emprego.",
       "body": [
        "Hello world,",
        "Recentemente, iniciei minha trajetória profissional no meu primeiro emprego, e tem sido uma experiência incrível! Tive a oportunidade de ingressar na Cognizant, uma das maiores empresas e referência no mercado de tecnologia, como Jovem Aprendiz. Atualmente, atuo como suporte técnico, mas tenho grandes sonhos e ambições dentro da organização. O suporte que recebo da empresa tem sido excepcional, e estou muito satisfeito com o ambiente e as oportunidades oferecidas.",
        "Minha jornada começou no final do mês passado, juntamente com o processo seletivo. Apesar de curto, o processo foi bastante completo: participei de aproximadamente quatro etapas, incluindo entrevistas com o setor de Recursos Humanos, gestores e alinhamentos gerais. Após a aprovação, passamos por um período de integração, que incluiu o onboarding e uma semana de capacitação no Instituto Ser+ — um programa obrigatório do governo voltado à formação de jovens aprendizes. Essa etapa foi uma excelente oportunidade para conhecer melhor meus colegas de trabalho, desenvolver novas amizades e fortalecer o espírito de equipe.",
        "Atualmente, faço parte de uma equipe com outros dois colegas, e estamos ansiosos para começar, de fato, nossas atividades. Enquanto isso, estamos nos dedicando à preparação para essa jornada, participando de aulas online, realizando cursos e nos capacitando continuamente. Sou imensamente grato por essa oportunidade e espero contribuir com excelência para o sucesso da empresa."
        
      ],
      "tags": [],
      "links": [],
      "image": null
    }
  ]
}